[
    {
        "image": "../img/synthULX-main.png",
        "title": "SynthULX",
        "subtitle": "Front End Capstone at Nashville Software School",
        "brief": "abbr. Synthesizer + User Learning Experience; SynthULX is a web application synthesizer utilizing the synthesis capabilities of the <strong>Web Audio API</strong> & the web audio framework <strong>Tone.Js</strong>. The application implements integrative learning techniques by providing a step-by-step tutorial, guiding users with input responsive diagrams (built with <strong>HTML5 Canvas</strong>) and dynamic content to user interactions with each major component found on modern synthesizers. Registered users can save, load, edit, & delete patches of synth parameters to their account; full <strong>CRUD</strong> methodology with <strong>Firebase</strong> authentication.",
        "link": "https://synthulx.firebaseapp.com",
        "repo": "https://github.com/iiimosley/synthULX"
    },
    {
        "image": "../img/webaudiosandbox.png",
        "title": "WebAudio SandBox",
        "brief": "Web application constructed for my presentation, <strong>Javascript Synthesis: Web Audio API &amp; Tones.Js</strong> at the <strong><a href='https://www.meetup.com/Nashville-Music-Programmers/' target='_blank'>Nashville Music Programmers</a></strong> meet-up. The application was built to give example to the AudioNode structure and routing paradigm in the Web Audio API. The application logs each AudioNode for group examination of components and demostrates the responsive changes in values to the AudioNode components. Open the WebAudio console in Firefox to view the routing paradigm.",
        "repo": "https://github.com/iiimosley/WebAudioSandBox"
    },
    {
        "image": "../img/static-web.png",
        "title": "Static Web Challenges",
        "brief": "A culmination of challenges given at Nashville Software School (~1mo into the program). Keep the console open to see results. Challenges include:<ul><li>Happy Numbers</li><li>Fibonacci Generator</li><li>CSS Shapes + Animation</li><li>Synced Input Values</li></ul>",
        "repo": "https://github.com/iiimosley/NSS-SW-Challenges"
    },
    {
        "image": "../img/sandwich-maker.png",
        "title": "Stack it Up!",
        "subtitle": "Sandwich Builder Application",
        "brief": "This application compiles all checked ingredients and returns a sum based on the quantity of each ingredient selected. Responsive checkboxes on 'None' remove any checkmarks on ingredients &amp; vice versa.",
        "repo": "https://github.com/iiimosley/NSS-SPA-Sandwich-Maker"
    }
]